       ?- valid(x > 0).
       false.

       ?- valid(x >= 0).
       true.

       ?- valid(exists(x, x > 0)).
       true.

       ?- valid(forall(x, exists(y, 3*x + y > 2))).
       true.

       ?- valid(2*y + 3*x = 30 /\ x = 0 ==> y = 15).
       true.

       ?- valid(x = 3 \/ not(x=3)).
       true.

       ?- valid(x = 5 ==> 2*x = 10).
       true.

       ?- valid(y > 1 /\ x = 3 /\ x + y < 19 ==> x + 19 > y).
       true.

